03_texturedPlate/02_transTexture/02_baseCaseMapped/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allrun.pre

application=`getApplication`

runParallel $application  4

runApplication reconstructPar

